In [63]:
import numpy as np

In [64]:
import pandas as pd

## SERİES

In [65]:
mydictionary = {"Menekşe" : 22, "Melike" : 21, "Melisa": 16}
pd.Series(mydictionary)

Menekşe    22
Melike     21
Melisa     16
dtype: int64

In [66]:
type(pd.Series(mydictionary))

pandas.core.series.Series

In [67]:
benimyaslarim = [22,21,16]
benimisimlerim = ["Menekşe","Melike","Melisa"]

In [68]:
pd.Series(benimyaslarim)

0    22
1    21
2    16
dtype: int64

In [69]:
pd.Series(benimisimlerim)

0    Menekşe
1     Melike
2     Melisa
dtype: object

In [70]:
pd.Series(benimyaslarim,benimisimlerim)

Menekşe    22
Melike     21
Melisa     16
dtype: int64

In [71]:
pd.Series(data = benimyaslarim, index = benimisimlerim)

Menekşe    22
Melike     21
Melisa     16
dtype: int64

In [72]:
pd.Series(np.array([10,20,30]),benimisimlerim)

Menekşe    10
Melike     20
Melisa     30
dtype: int32

## DataFrame

In [73]:
data = np.random.randint(0,100,(4,3))

In [74]:
dataframe = pd.DataFrame(data)

In [75]:
dataframe

    0   1   2
0  60  95  13
1  86  34  28
2  53  93  15
3  60  99  82

In [76]:
dataframe[0]

0    60
1    86
2    53
3    60
Name: 0, dtype: int32

In [77]:
newdataFrame = pd.DataFrame(data,index = ["Menekşe","Melike","Melisa","Meltem"],columns = ["Maas","Yas","Puan"])

In [78]:
newdataFrame

         Maas  Yas  Puan
Menekşe    60   95    13
Melike     86   34    28
Melisa     53   93    15
Meltem     60   99    82

In [79]:
newdataFrame["Yas"]

Menekşe    95
Melike     34
Melisa     93
Meltem     99
Name: Yas, dtype: int32

In [80]:
newdataFrame[["Maas","Yas"]]

         Maas  Yas
Menekşe    60   95
Melike     86   34
Melisa     53   93
Meltem     60   99

In [81]:
newdataFrame.loc["Menekşe"]

Maas    60
Yas     95
Puan    13
Name: Menekşe, dtype: int32

In [82]:
newdataFrame.iloc[1]

Maas    86
Yas     34
Puan    28
Name: Melike, dtype: int32

In [83]:
newdataFrame["Emeklilik"] = np.random.randint(0,100,4)

In [84]:
newdataFrame

         Maas  Yas  Puan  Emeklilik
Menekşe    60   95    13         70
Melike     86   34    28         82
Melisa     53   93    15         73
Meltem     60   99    82         36

In [85]:
newdataFrame.drop("Emeklilik",axis = 1)

         Maas  Yas  Puan
Menekşe    60   95    13
Melike     86   34    28
Melisa     53   93    15
Meltem     60   99    82

In [86]:
newdataFrame.drop("Meltem", axis =0)

         Maas  Yas  Puan  Emeklilik
Menekşe    60   95    13         70
Melike     86   34    28         82
Melisa     53   93    15         73

In [87]:
newdataFrame

         Maas  Yas  Puan  Emeklilik
Menekşe    60   95    13         70
Melike     86   34    28         82
Melisa     53   93    15         73
Meltem     60   99    82         36

In [88]:
newdataFrame.drop("Emeklilik", axis = 1, inplace = True)

In [89]:
newdataFrame

         Maas  Yas  Puan
Menekşe    60   95    13
Melike     86   34    28
Melisa     53   93    15
Meltem     60   99    82

In [90]:
newdataFrame.loc["Menekşe"]["Yas"]

95

In [91]:
newdataFrame.loc["Menekşe","Yas"]

95

In [92]:
newdataFrame["Yas"][newdataFrame["Yas"] >89]

Menekşe    95
Melisa     93
Meltem     99
Name: Yas, dtype: int32

In [93]:
newdataFrame.reset_index()

     index  Maas  Yas  Puan
0  Menekşe    60   95    13
1   Melike    86   34    28
2   Melisa    53   93    15
3   Meltem    60   99    82

In [94]:
newdataFrame.index = ["Menek","Melik","Melis","Melt"]
newdataFrame

       Maas  Yas  Puan
Menek    60   95    13
Melik    86   34    28
Melis    53   93    15
Melt     60   99    82

In [95]:
newdataFrame

       Maas  Yas  Puan
Menek    60   95    13
Melik    86   34    28
Melis    53   93    15
Melt     60   99    82

In [96]:
yeniindexListesi = ["Menekşe","Melike","Melisa","Meltem"]
newdataFrame["Yeni İndex"] = yeniindexListesi

In [97]:
newdataFrame

       Maas  Yas  Puan Yeni İndex
Menek    60   95    13    Menekşe
Melik    86   34    28     Melike
Melis    53   93    15     Melisa
Melt     60   99    82     Meltem

In [98]:
newdataFrame.set_index("Yeni İndex")

            Maas  Yas  Puan
Yeni İndex
Menekşe       60   95    13
Melike        86   34    28
Melisa        53   93    15
Meltem        60   99    82

## Multi Indexs

In [108]:
firstindex = ["Sebze","Sebze","Sebze","Meyve","Meyve","Meyve"]
secondindex = ["Marul","Soğan","Pırasa","Elma","Avakado","Kiraz"]

In [109]:
data = np.random.randint(0,20,(6,3))

In [110]:
combinedindex = list(zip(firstindex,secondindex))

In [111]:
combinedindex = pd.MultiIndex.from_tuples(combinedindex)

In [113]:
newdataFrame = pd.DataFrame(data,index = combinedindex, columns = ["a","b","c"])

In [114]:
newdataFrame

                a   b   c
Sebze Marul     2  11  11
      Soğan    10  13  10
      Pırasa    8  13   9
Meyve Elma     12   5   6
      Avakado   3  19   3
      Kiraz     3   2  10

In [120]:
newdataFrame.loc["Sebze"].loc["Marul"]

a     2
b    11
c    11
Name: Marul, dtype: int32

In [121]:
newdataFrame.index.names = ["Grup","İsim"]

In [122]:
newdataFrame

                a   b   c
Grup  İsim
Sebze Marul     2  11  11
      Soğan    10  13  10
      Pırasa    8  13   9
Meyve Elma     12   5   6
      Avakado   3  19   3
      Kiraz     3   2  10